{"keras_version": "1.2.0", "config": {"layers": [{"inbound_nodes": [], "name": "input_1", "config": {"sparse": false, "input_dtype": "float32", "batch_input_shape": [null, 160, 320, 3], "name": "input_1"}, "class_name": "InputLayer"}, {"inbound_nodes": [[["input_1", 0, 0]]], "name": "block1_conv1", "config": {"init": "glorot_uniform", "W_constraint": null, "trainable": false, "dim_ordering": "tf", "nb_row": 3, "activity_regularizer": null, "b_regularizer": null, "nb_col": 3, "border_mode": "same", "W_regularizer": null, "nb_filter": 64, "name": "block1_conv1", "bias": true, "activation": "relu", "b_constraint": null, "subsample": [1, 1]}, "class_name": "Convolution2D"}, {"inbound_nodes": [[["block1_conv1", 0, 0]]], "name": "block1_conv2", "config": {"init": "glorot_uniform", "W_constraint": null, "trainable": false, "dim_ordering": "tf", "nb_row": 3, "activity_regularizer": null, "b_regularizer": null, "nb_col": 3, "border_mode": "same", "W_regularizer": null, "nb_filter": 64, "name": "block1_conv2", "bias": true, "activation": "relu", "b_constraint": null, "subsample": [1, 1]}, "class_name": "Convolution2D"}, {"inbound_nodes": [[["block1_conv2", 0, 0]]], "name": "block1_pool", "config": {"trainable": false, "name": "block1_pool", "dim_ordering": "tf", "pool_size": [2, 2], "strides": [2, 2], "border_mode": "valid"}, "class_name": "MaxPooling2D"}, {"inbound_nodes": [[["block1_pool", 0, 0]]], "name": "block2_conv1", "config": {"init": "glorot_uniform", "W_constraint": null, "trainable": false, "dim_ordering": "tf", "nb_row": 3, "activity_regularizer": null, "b_regularizer": null, "nb_col": 3, "border_mode": "same", "W_regularizer": null, "nb_filter": 128, "name": "block2_conv1", "bias": true, "activation": "relu", "b_constraint": null, "subsample": [1, 1]}, "class_name": "Convolution2D"}, {"inbound_nodes": [[["block2_conv1", 0, 0]]], "name": "block2_conv2", "config": {"init": "glorot_uniform", "W_constraint": null, "trainable": false, "dim_ordering": "tf", "nb_row": 3, "activity_regularizer": null, "b_regularizer": null, "nb_col": 3, "border_mode": "same", "W_regularizer": null, "nb_filter": 128, "name": "block2_conv2", "bias": true, "activation": "relu", "b_constraint": null, "subsample": [1, 1]}, "class_name": "Convolution2D"}, {"inbound_nodes": [[["block2_conv2", 0, 0]]], "name": "block2_pool", "config": {"trainable": false, "name": "block2_pool", "dim_ordering": "tf", "pool_size": [2, 2], "strides": [2, 2], "border_mode": "valid"}, "class_name": "MaxPooling2D"}, {"inbound_nodes": [[["block2_pool", 0, 0]]], "name": "block3_conv1", "config": {"init": "glorot_uniform", "W_constraint": null, "trainable": false, "dim_ordering": "tf", "nb_row": 3, "activity_regularizer": null, "b_regularizer": null, "nb_col": 3, "border_mode": "same", "W_regularizer": null, "nb_filter": 256, "name": "block3_conv1", "bias": true, "activation": "relu", "b_constraint": null, "subsample": [1, 1]}, "class_name": "Convolution2D"}, {"inbound_nodes": [[["block3_conv1", 0, 0]]], "name": "block3_conv2", "config": {"init": "glorot_uniform", "W_constraint": null, "trainable": false, "dim_ordering": "tf", "nb_row": 3, "activity_regularizer": null, "b_regularizer": null, "nb_col": 3, "border_mode": "same", "W_regularizer": null, "nb_filter": 256, "name": "block3_conv2", "bias": true, "activation": "relu", "b_constraint": null, "subsample": [1, 1]}, "class_name": "Convolution2D"}, {"inbound_nodes": [[["block3_conv2", 0, 0]]], "name": "block3_conv3", "config": {"init": "glorot_uniform", "W_constraint": null, "trainable": false, "dim_ordering": "tf", "nb_row": 3, "activity_regularizer": null, "b_regularizer": null, "nb_col": 3, "border_mode": "same", "W_regularizer": null, "nb_filter": 256, "name": "block3_conv3", "bias": true, "activation": "relu", "b_constraint": null, "subsample": [1, 1]}, "class_name": "Convolution2D"}, {"inbound_nodes": [[["block3_conv3", 0, 0]]], "name": "block3_pool", "config": {"trainable": false, "name": "block3_pool", "dim_ordering": "tf", "pool_size": [2, 2], "strides": [2, 2], "border_mode": "valid"}, "class_name": "MaxPooling2D"}, {"inbound_nodes": [[["block3_pool", 0, 0]]], "name": "block4_conv1", "config": {"init": "glorot_uniform", "W_constraint": null, "trainable": false, "dim_ordering": "tf", "nb_row": 3, "activity_regularizer": null, "b_regularizer": null, "nb_col": 3, "border_mode": "same", "W_regularizer": null, "nb_filter": 512, "name": "block4_conv1", "bias": true, "activation": "relu", "b_constraint": null, "subsample": [1, 1]}, "class_name": "Convolution2D"}, {"inbound_nodes": [[["block4_conv1", 0, 0]]], "name": "block4_conv2", "config": {"init": "glorot_uniform", "W_constraint": null, "trainable": false, "dim_ordering": "tf", "nb_row": 3, "activity_regularizer": null, "b_regularizer": null, "nb_col": 3, "border_mode": "same", "W_regularizer": null, "nb_filter": 512, "name": "block4_conv2", "bias": true, "activation": "relu", "b_constraint": null, "subsample": [1, 1]}, "class_name": "Convolution2D"}, {"inbound_nodes": [[["block4_conv2", 0, 0]]], "name": "block4_conv3", "config": {"init": "glorot_uniform", "W_constraint": null, "trainable": false, "dim_ordering": "tf", "nb_row": 3, "activity_regularizer": null, "b_regularizer": null, "nb_col": 3, "border_mode": "same", "W_regularizer": null, "nb_filter": 512, "name": "block4_conv3", "bias": true, "activation": "relu", "b_constraint": null, "subsample": [1, 1]}, "class_name": "Convolution2D"}, {"inbound_nodes": [[["block4_conv3", 0, 0]]], "name": "block4_pool", "config": {"trainable": false, "name": "block4_pool", "dim_ordering": "tf", "pool_size": [2, 2], "strides": [2, 2], "border_mode": "valid"}, "class_name": "MaxPooling2D"}, {"inbound_nodes": [[["block4_pool", 0, 0]]], "name": "block5_conv1", "config": {"init": "glorot_uniform", "W_constraint": null, "trainable": true, "dim_ordering": "tf", "nb_row": 3, "activity_regularizer": null, "b_regularizer": null, "nb_col": 3, "border_mode": "same", "W_regularizer": null, "nb_filter": 512, "name": "block5_conv1", "bias": true, "activation": "relu", "b_constraint": null, "subsample": [2, 2]}, "class_name": "Convolution2D"}, {"inbound_nodes": [[["block5_conv1", 0, 0]]], "name": "block5_conv2", "config": {"init": "glorot_uniform", "W_constraint": null, "trainable": true, "dim_ordering": "tf", "nb_row": 3, "activity_regularizer": null, "b_regularizer": null, "nb_col": 3, "border_mode": "same", "W_regularizer": null, "nb_filter": 512, "name": "block5_conv2", "bias": true, "activation": "relu", "b_constraint": null, "subsample": [1, 2]}, "class_name": "Convolution2D"}, {"inbound_nodes": [[["block5_conv2", 0, 0]]], "name": "block5_conv3", "config": {"init": "glorot_uniform", "W_constraint": null, "trainable": true, "dim_ordering": "tf", "nb_row": 3, "activity_regularizer": null, "b_regularizer": null, "nb_col": 3, "border_mode": "same", "W_regularizer": null, "nb_filter": 512, "name": "block5_conv3", "bias": true, "activation": "relu", "b_constraint": null, "subsample": [1, 2]}, "class_name": "Convolution2D"}, {"inbound_nodes": [[["block5_conv3", 0, 0]]], "name": "flatten_1", "config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"inbound_nodes": [[["flatten_1", 0, 0]]], "name": "dropout_1", "config": {"trainable": true, "name": "dropout_1", "p": 0.2}, "class_name": "Dropout"}, {"inbound_nodes": [[["dropout_1", 0, 0]]], "name": "fc1", "config": {"output_dim": 2048, "W_constraint": null, "name": "fc1", "activity_regularizer": null, "b_regularizer": null, "W_regularizer": null, "init": "glorot_uniform", "trainable": true, "bias": true, "activation": "relu", "b_constraint": null, "input_dim": 7680}, "class_name": "Dense"}, {"inbound_nodes": [[["fc1", 0, 0]]], "name": "dropout_2", "config": {"trainable": true, "name": "dropout_2", "p": 0.2}, "class_name": "Dropout"}, {"inbound_nodes": [[["dropout_2", 0, 0]]], "name": "fc2", "config": {"output_dim": 1024, "W_constraint": null, "name": "fc2", "activity_regularizer": null, "b_regularizer": null, "W_regularizer": null, "init": "glorot_uniform", "trainable": true, "bias": true, "activation": "relu", "b_constraint": null, "input_dim": 2048}, "class_name": "Dense"}, {"inbound_nodes": [[["fc2", 0, 0]]], "name": "dropout_3", "config": {"trainable": true, "name": "dropout_3", "p": 0.5}, "class_name": "Dropout"}, {"inbound_nodes": [[["dropout_3", 0, 0]]], "name": "predictions", "config": {"output_dim": 1, "W_constraint": null, "name": "predictions", "activity_regularizer": null, "b_regularizer": null, "W_regularizer": null, "init": "glorot_uniform", "trainable": true, "bias": true, "activation": "tanh", "b_constraint": null, "input_dim": 1024}, "class_name": "Dense"}], "input_layers": [["input_1", 0, 0]], "output_layers": [["predictions", 0, 0]], "name": "model_1"}, "class_name": "Model"}