{"keras_version": "1.2.0", "config": [{"config": {"input_length": null, "W_regularizer": null, "bias": true, "filter_length": 3, "b_constraint": null, "trainable": true, "input_dtype": "float32", "batch_input_shape": [null, 32, 64], "subsample_length": 1, "name": "convolution1d_1", "nb_filter": 16, "input_dim": null, "activation": "linear", "W_constraint": null, "border_mode": "same", "b_regularizer": null, "activity_regularizer": null, "init": "glorot_uniform"}, "class_name": "Convolution1D"}, {"config": {"activation": "relu", "name": "activation_1", "trainable": true}, "class_name": "Activation"}, {"config": {"input_length": null, "W_regularizer": null, "bias": true, "filter_length": 3, "b_constraint": null, "trainable": true, "subsample_length": 1, "name": "convolution1d_2", "nb_filter": 32, "input_dim": null, "activation": "linear", "W_constraint": null, "border_mode": "same", "b_regularizer": null, "activity_regularizer": null, "init": "glorot_uniform"}, "class_name": "Convolution1D"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"activation": "relu", "name": "activation_2", "trainable": true}, "class_name": "Activation"}, {"config": {"trainable": true, "W_regularizer": null, "bias": true, "output_dim": 64, "b_constraint": null, "name": "dense_1", "input_dim": 1024, "activation": "linear", "W_constraint": null, "b_regularizer": null, "activity_regularizer": null, "init": "glorot_uniform"}, "class_name": "Dense"}, {"config": {"p": 0.5, "name": "dropout_1", "trainable": true}, "class_name": "Dropout"}, {"config": {"activation": "relu", "name": "activation_3", "trainable": true}, "class_name": "Activation"}, {"config": {"trainable": true, "W_regularizer": null, "bias": true, "output_dim": 1, "b_constraint": null, "name": "dense_2", "input_dim": 64, "activation": "linear", "W_constraint": null, "b_regularizer": null, "activity_regularizer": null, "init": "glorot_uniform"}, "class_name": "Dense"}], "class_name": "Sequential"}