{"config": [{"config": {"input_dtype": "float32", "trainable": true, "name": "batchnormalization_1", "beta_regularizer": null, "gamma_regularizer": null, "momentum": 0.99, "axis": -1, "epsilon": 0.001, "mode": 0, "batch_input_shape": [null, 160, 320, 3]}, "class_name": "BatchNormalization"}, {"config": {"W_regularizer": null, "subsample": [4, 4], "name": "convolution2d_1", "b_constraint": null, "nb_filter": 16, "W_constraint": null, "nb_col": 8, "b_regularizer": null, "nb_row": 8, "trainable": true, "bias": true, "activity_regularizer": null, "activation": "linear", "border_mode": "same", "dim_ordering": "tf", "init": "glorot_uniform"}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "elu_1", "alpha": 1.0}, "class_name": "ELU"}, {"config": {"W_regularizer": null, "subsample": [2, 2], "name": "convolution2d_2", "b_constraint": null, "nb_filter": 32, "W_constraint": null, "nb_col": 5, "b_regularizer": null, "nb_row": 5, "trainable": true, "bias": true, "activity_regularizer": null, "activation": "linear", "border_mode": "same", "dim_ordering": "tf", "init": "glorot_uniform"}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "elu_2", "alpha": 1.0}, "class_name": "ELU"}, {"config": {"W_regularizer": null, "subsample": [2, 2], "name": "convolution2d_3", "b_constraint": null, "nb_filter": 64, "W_constraint": null, "nb_col": 5, "b_regularizer": null, "nb_row": 5, "trainable": true, "bias": true, "activity_regularizer": null, "activation": "linear", "border_mode": "same", "dim_ordering": "tf", "init": "glorot_uniform"}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"trainable": true, "name": "dropout_1", "p": 0.2}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "elu_3", "alpha": 1.0}, "class_name": "ELU"}, {"config": {"W_regularizer": null, "name": "dense_1", "b_constraint": null, "output_dim": 512, "W_constraint": null, "input_dim": 12800, "b_regularizer": null, "trainable": true, "bias": true, "activity_regularizer": null, "init": "glorot_uniform", "activation": "linear"}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "dropout_2", "p": 0.5}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "elu_4", "alpha": 1.0}, "class_name": "ELU"}, {"config": {"W_regularizer": null, "name": "dense_2", "b_constraint": null, "output_dim": 1, "W_constraint": null, "input_dim": 512, "b_regularizer": null, "trainable": true, "bias": true, "activity_regularizer": null, "init": "glorot_uniform", "activation": "linear"}, "class_name": "Dense"}], "keras_version": "1.2.0", "class_name": "Sequential"}